# Konversi nilai numerik ke dalam sejumlah kategori

### Import Modul dan Cek Versi

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [2]:
n_rows = 10 
n_cols = 1 
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)),
                  columns=cols)
df

   usia
0    33
1    49
2    12
3    14
4    19
5    63
6    47
7    84
8    22
9    97

# Pengelompokkan ke dalam beberapa kategori dengan cut()

In [3]:
df['kelompok usia'] = pd.cut(df['usia'],
                            bins = [0, 18, 65, 99],
                            labels = ['anak', 'dewasa', 'manula'])
df

#membentuk kolom baru dengan nama kelompok usia
#pd.cut untuk mengelompokkan data ke beberapa kategori
#proses pemotongan dengan menggunakan bins berupa list
#parameter ketiga dengan menggunakan labels

   usia kelompok usia
0    33        dewasa
1    49        dewasa
2    12          anak
3    14          anak
4    19        dewasa
5    63        dewasa
6    47        dewasa
7    84        manula
8    22        dewasa
9    97        manula